---
layout: post
title:  Linux Yaz Kampı 2016 Hakkında
tags:
- LYK2016
- WebUygulamaGüvenliği
- GüvenliKodYazma
- LinuxCandır
- GerisiHeyecandır
---
<link rel="stylesheet" type="text/css" href="../static/css/style_lyknotlarim.css">

<p class="subject"><br/>
&emsp;Nasıl bir giriş yapmam gerektiğini bilmiyorum. &Ccedil;&uuml;nk&uuml; bu benim ilk blog yazım. Uzun s&uuml;redir a&ccedil;mak istiyordum fakat fırsat bulamamıştım. İlk blog yazım kamp hakkında olacakmış. Ge&ccedil;en sene Linux Yaz Kamp'ında 'Linux Sistem Y&ouml;netimi' eğitimine katılmıştım. Kampın en küçüklerinden biri olarak oldukça verimli bir süreç geçirdim. Orada tanıştığım yaşıma aldırmadan benimle yaşıtları gibi sohbet eden kişilerle hala görüşüyorum. Bu sene ise kampa katılıp katılmama konusunda kararsızdım. Lise 3&rsquo;e ge&ccedil;ecek olmam nedeniyle acaba o 15 g&uuml;n ders mi &ccedil;alışmalıyım? D&uuml;ş&uuml;ncesi vardı tabii. Ama katılmaya karar verdim. Sızma Testi ve Web Uygulama G&uuml;venliği kurslarına başvurdum. İkinci başvurum olan Web Uygulama G&uuml;venliği kursu i&ccedil;in bir sınav yapıldı. &Ccedil;&ouml;zd&uuml;m, sonu&ccedil; olarak ise se&ccedil;ildim.</p>

<p>&emsp;İlk g&uuml;nden son g&uuml;ne 09.30 , 21.30 arası durmaksızın ders işledik. Sınıfa ge&ccedil; gelenlerden para toplama g&ouml;revi bana verilmişti. Son hafta baklava alacaktık ^^ Daha sonra ise <strong>BaklavaCMS&rsquo;imizi yazdık!</strong> Ve yazdığımız sistem &uuml;zerinden toplamaya devam ettik.</p>

<p>&emsp;&Ouml;mer Hoca ve Murat Hoca kamp boyunca yılmadan bize bir şeyler anlatma &ccedil;abası i&ccedil;erisindeydiler. Kampta bir g&uuml;n ara veriliyor. O g&uuml;n genelde Bolu i&ccedil;erisinde gezi d&uuml;zenleniyor. Biz ise gezmek yerine sınıf olarak <strong>sabahlamaya karar verdik!</strong> Bizim i&ccedil;in &ccedil;ok g&uuml;zel bir CTF hazırlanmıştı. Artık şov yapacaktık ;) Yiyeceklerimizi de unutmadık tabii ki.</p>

<p><img class="image" src="../static/img/post1_1.jpg"></p>

<p>Fakat sanırım hocalarımızı biraz fazla yormuşuz ^^ Yaklaşık saat 1 gibi biraz kestirdiler&hellip;<img class="image" src="../static/img/post1_2.jpg" /></p>

<p><br />
&nbsp;</p>

<p><br />
&nbsp;</p>

<p>Gece 03.30 gibi &Ouml;mer Hoca bizim i&ccedil;in sucuk ekmek almaya da gitti ^^ ( Ne kadar fedakar bir eğitmen olduğundan bahsetmeme gerek yok sanırım :)) Sabah 7.30 gibi CTF&rsquo;i bitirip dağılmaya karar verdik. Fakat belirli bir saate kadar kamp&uuml;s i&ccedil;erisinden ulaşım sağlanmıyormuş. Tabi biz hemen meşhur korsan taksicimizi aradık. Bize b&uuml;y&uuml;k bir otob&uuml;s g&ouml;nderdi. Kampta en eğlendiğim g&uuml;n ş&uuml;phesiz sabahladığımız g&uuml;n olabilir.</p>

<p>Artık konuları neredeyse tamamlamıştık. İsteyen g&uuml;venlikle alakalı istediği bir konuya hazırlanıp anlatabilirdi. Tabi ben hemen bir konu se&ccedil;ip bir sonraki g&uuml;n anlatmak i&ccedil;in &Ouml;mer Hoca&rsquo;yı sıkıştırdım :) Daha &ouml;ncesinde Merve ile beraber sınıfta TCP/IP anlatmıştık fakat &ccedil;ok uzun s&uuml;rmemişti. Şimdi ise neredeyse y&uuml;rek yemiştim! <strong>Linux Yaz Kampında Active Directory </strong>anlatacaktım! Anlattım da, &ouml;nce klasik  sızma testleri nedir ne değildir ile başlayıp canlı canlı ele ge&ccedil;irdiğimiz bir sistemde post exploitation&rsquo;a kadar anlatmaya &ccedil;alıştım.</p>

<p><img class="image" src="../static/img/post1_3.jpg" /></p>

<p><br />
&nbsp;</p>

<p>Sınıf&ccedil;a malware bile oluşturduk. Active Directory&rsquo;e y&ouml;nelik yapılan birka&ccedil; saldırı &uuml;zerinde durdum. Yaklaşık 2 saat s&uuml;ren benim a&ccedil;ımdan verimli ge&ccedil;en bir sunumdu. &Ouml;ğrendiğim diğer bir şey de yazımın &ccedil;ok k&ouml;t&uuml; olmasıydı.</p>

<p><img class="image" src="../static/img/post1_4.jpg"></p>

<p><br />
&nbsp;</p>

<p>XSSfinder da yazdık. Bence oldukça kullanışlı oldu.</p>

<p>Son g&uuml;n ise &Ouml;mer Hoca ve Murat Hoca&rsquo;ya drone hediye ettik ^^ Nasıl &ccedil;alıştığını anlamadan u&ccedil;urmaya kalkıştık&hellip; En son t&uuml;m sınıf kamp&uuml;se dağılmış <strong>kayıp drone</strong>&rsquo;u arıyorduk. Biraz zorlanmamıza rağmen bulabildik. Sebebi de malum "man drone" O zamaan RTFM! diyerek postumuzu burada bitirelim. Seneye de gelmeye &ccedil;alışacağım. G&ouml;r&uuml;şmek &uuml;zere ♥ </p>
<img class="image" src="../static/img/image1.JPG">
